data = {
    'комнаты': [
        {
            'номер': 4,
            'ширина': 4.5,
            'длинна': 6.3,
            'стоимость': 4000,
            'посетителей допустимо': 3,
            'заселено': 0,
            'предметы': {'шкаф B': 2, "телевизор ACA": 1, "стол дерево": 2, "стул пластик A": 5, 'кровать C': 1}
        },
        {
            'номер': 6,
            'ширина': 5.5,
            'длинна': 2.3,
            'стоимость': 3000,
            'посетителей допустимо': 1,
            'заселено': 1,
            'предметы': {'шкаф B': 1, "стол пластик": 1, "стул пластик A": 1, 'кровать D': 1}
        },
    ]
}
