# data = {
#     'комнаты': [
#         {
#             'номер': 4,
#             'ширина': 4.5,
#             'длинна': 6.3,
#             'стоимость': 4000,
#             'посетителей допустимо': 3,
#             'заселено': 0,
#             'предметы': {'шкаф B': 2, "телевизор ACA": 1, "стол дерево": 2, "стул пластик A": 5, 'кровать C': 1}
#         },
#         {
#             'номер': 6,
#             'ширина': 5.5,
#             'длинна': 2.3,
#             'стоимость': 3000,
#             'посетителей допустимо': 1,
#             'заселено': 1,
#             'предметы': {'шкаф B': 1, "стол пластик": 1, "стул пластик A": 1, 'кровать D': 1}
#         },
#     ]
# }


def night_menu_1(self, user, t):
    if t == 'Мафіозник':
        t = input('Кого ви хочете вбити' + 'p1 ' + 'p2 ' + 'p3 ' + 'p4 ' + 'p5 ')
        if t == 'p1':
            if p1 in d:
                t = input("виберіть іншу жертву:")
            else:
                i.remove(p1)
                d.append(p1)
                print("Мафіозник зробив хід")
        if t == 'p2':
            if p2 in d:
                t = input("виберіть іншу жертву:")
            else:
                i.remove(p2)
                d.append(p2)
                print("Мафіозник зробив хід")

        if t == 'p3':
            if p3 in d:
                t = input("виберіть іншу жертву:")
            else:
                i.remove(p3)
                d.append(p3)
                print("Мафіозник зробив хід")

        if t == 'p4':
            if p4 in d:
                t = input("виберіть іншу жертву:")
            else:
                i.remove(p4)
                d.append(p4)
                print("Мафіозник зробив хід")

        if t == 'p5':
            if p5 in d:
                t = input("виберіть іншу жертву:")
            else:
                i.remove(p5)
                d.append(p5)
                print("Мафіозник зробив хід")

        else:
            a = random.choice(i)
            if a in d:
                t = input("виберіть іншу жертву:")
            else:
                i.remove(a)
                d.append(a)
        print("Мафіозник зробив хід")
        print("мафія засинає, лікар прокидається")
        night_menu_2(user)
