# Написать лямбда - функцию, которая принимает строку,
# и возвращает первую букву этой строки в нижнем регистре 

stroka = 'Hello World'
k = lambda stroka: stroka[0].lower()
print(k(stroka))

