#Написать лямбда - функцию, которая принимает число и возвращает результат деления этого числа на 2
num = 5
#print(lambda num: num / 2)
k = lambda num: num / 2
print(k(num))
