def strange_list_sum(value):
    """
    [1, 5, [1, [1, [[[2, [1]]], 1, [1, 2]]], 2], 1, [1, [[[[]]]]]]


    f([1, [1, [[3]]], 1]) = f(1) + f([[1, [[3]]], 1]) = 1 + f([[1, [[3]]], 1])
    f(1) = 1   !  зупинка!  коли в функцію прийшло число!

    f([[1, [[3]]], 1]) = f([1, [[3]]]) + f([1])
    f([1, [[3]]]) = f(1) + f([[[3]]]) = 1 + f([[3]]) + f([]) = |
    f([]) = 0  ! зупинка! коли в функцію прийшов пустий список
    | = 1 + f([[3]]) + 0 = 1 + f([[3]]) = 1 + f([3]) + f([]) = 1 + 0 + f([3]) =
    = 1 + 3 + f([]) = 1 + 3 = 4
    """
    if type(value) is int:
        return value
    if len(value) == 0:
        return 0

    return strange_list_sum(value[0]) + strange_list_sum(value[1:])


print(strange_list_sum([1, 5, [1, [1, [[[2, [1]]], 1, [1, 2]]], 2], 1, [1, [[[[]]]]]]))
